{"TITLE": "Data Scientist", "COMPANY_NAME": "Pickle", "JOB_DATE": "2023-08-14", "JOB_LINK": "https://www.linkedin.com/jobs/search/?currentJobId=3693874383&keywords=data%20scientist&position=1&pageNum=0#main-content", "JOB_LOCATION": "New York, United States", "JOB_SENIORITY_LEVEL": "Mid-Senior level", "JOB_EMPLOYMENT_TYPE": "Full-time", "JOB_FUNCTION": "Engineering", "JOB_INDUSTRIES": "Technology, Information and Internet", "NUMBER_APPLICANTS": "not found", "JOB_DESCRIPTION": "Must be located in NYC. Please apply by emailing recruiting@shoponpickle.com\n\n\n\n\nPickle is a rental marketplace that aims to monetize the billions of underutilized assets sitting in consumers closets and brands inventory. Users can easily tap into shared closets within their community through flexible and/or on-demand delivery options. Our goal is to provide affordable and convenient access to quality items exactly when our users need them. We are starting with P2P clothing/accessories and expanding to other categories.\n\n\n\n\nWe are seeking a talented and motivated Growth Engineer to join our team and play a crucial role in driving user acquisition, retention, and overall marketplace growth for our platform. The Growth Engineer will combine technical expertise with strategic thinking to optimize user journeys, enhance features, and implement data-driven growth initiatives. This candidate will work directly with the co-founders to hit growth goals.\n\n\n\n\nRequirements\n\n\n\n\nExperience in growth engineering or a similar role, preferably within e-commerce, marketplace, or tech startup environments\nStrong proficiency in programming languages such as Python, JavaScript, or similar, and experience with relevant frameworks and libraries\nSolid understanding of data analytics, A/B testing, and user behavior tracking\nExperience with web and app optimization techniques for user onboarding improvements\nExperience working with growth tools and platforms, such as Mixpanel, Google Analytics, or similar\nBachelor's degree in Computer Science, Engineering, or a related field. Advanced degree or relevant certifications are a plus\n\n\n\n\nResponsibilities\nCollaborate with cross-functional teams, including product and marketing to develop and execute growth strategies that align with business goals\nProvide technical support and insights to the marketing team for the execution of data-driven campaigns and initiatives\nIdentify and prioritize growth opportunities through data analysis, A/B testing, and user behavior insights\nDevelop and implement technical solutions to improve user acquisition, activation, and customer conversion rates across the platform\nContinuously monitor and evaluate the effectiveness of growth initiatives and experiments, iterating on strategies based on data-driven insights\nBuild and maintain scalable systems for tracking and analyzing key performance metrics related to growth efforts\nCollaborate with the engineering team to implement website and app enhancements to improve the overall user experience\nOptimize and enhance user onboarding processes to ensure a seamless experience and increase download to sign-up conversion rates\nDevelop and maintain referral programs, user incentives, and loyalty programs to encourage user-generated growth\n\n\n\n\nBenefits\n\n\n\n\nGrow with the company\nWork directly with the founders and executive team\nProfessional coaching\nTraining & Development", "NUMBER_JOBS": "165,000+"}